[
    [
        "Gift codes",
        "To redeem a gift code, you can open <b>Market</b> &gt; <b>Redeem</b> and enter the code then click <b>Redeem</b>."
    ],
    [
        "Props",
        "There are some props that you can interact with, such as the Harp or the Drums. Why not try them out?"
    ],
    [
        "Morph",
        "If you are on mobile, the Properties will be hidden. To show them, just tap the button on the right that says <b>Properties</b>"
    ],
    [
        "Props",
        "To ensure safety, some props may require a specific RP Rank to purchase. So, why not start roleplaying to gain EXP?"
    ],
    [
        "Memberships",
        "Show us your support by purchasing our Membership tiers in the Market! You can also donate to us via Robux."
    ],
    [
        "Morph",
        "To change your image size, roleplay name, and more, go to the <b>Properties</b> section of the Morph screen. If you’re on Mobile, that panel is hidden. Click on <b>Properties</b> on the right to show them."
    ],
    [
        "Roleplay EXP",
        "To increase your RP Rank, you need Roleplay EXP. You can earn Roleplay EXP by just staying in the experience, or talking in the chat!"
    ],
    [
        "Gift codes",
        "Join our official community server for gift codes as we post them occasionally!"
    ],
    [
        "Feedback",
        "Got any issues or concerns about 2D Image Roleplay? Use the Feedback feature!"
    ],
    [
        "Settings",
        "Is your device running slow? Try lowering/disabling the graphics options in the Settings."
    ],
    [
        "Maps",
        "You can travel to different maps by going into one of the portals, or opening the Map."
    ],
    [
        "Community Server",
        "Want to discuss 2D Image Roleplay, and learn what comes next? Join our official Discord server!"
    ],
    [
        "Restricted Images",
        "If you are about to morph into an image that is unsafe for children, be sure to enable <b>Restrict from users &lt;13</b> in the Properties panel."
    ],
    [
        "Restricted Images",
        "If you forget to restrict your image containing content that’s unsafe for children, you will have a chance of getting banned permanently."
    ]
]
