{
	"latest": 23122300,
	"template": [
		{
			"id": 23,
			"updateType": "update",
			"title": "V3. Release Notes ()",
			"bannerImage": null,
			"content": [
				[
					"fix",
					""
				],
				[
					"add",
					""
				],
				[
					"remove",
					""
				],
				[
					"critical",
					""
				]
			]
		}
	],
	"listing": [
		{
			"id": 23123000,
			"updateType": "update",
			"title": "V3.6 Release Notes (30 Dec 2023)",
			"bannerImage": null,
			"content": [
				[
					"fix",
					"Fixed the sound distance for the Piano in the Lobby."
				],
				[
					"fix",
					"Fixed writing issue in the About section of the Settings."
				],
				[
					"add",
					"Added buttons that allows you to restore certain properties to their defaults on the Morph customisation."
				],
				[
					"fix",
					"Fixed additional issues."
				]
			]
		},
		{
			"id": 23122300,
			"updateType": "update",
			"title": "V3.5 Release Notes (23 Dec 2023)",
			"bannerImage": null,
			"content": [
				[
					"fix",
					"Fixed an issue where Special group members don't have Gold Membership automatically."
				],
				[
					"fix",
					"Done some rewording on the Selfie screen and Favourites removal messages."
				],
				[
					"fix",
					"Updated search keyword blacklist for the Audio Library."
				],
				[
					"fix",
					"Fixed an issue where characters start colliding with each other."
				],
				[
					"add",
					"Added a sign beside the Portal Ad in the Lobby."
				],
				[
					"fix",
					"Prevent new items from getting added to the people list when searching for a person."
				],
				[
					"fix",
					"Fixed an issue with the in-experience chat system."
				],
				[
					"fix",
					"Fixed an issue with saving purchased props."
				],
				[
					"fix",
					"Fixed issues with the custom chat filter."
				],
				[
					"fix",
					"Updated the icon for Owner and Co-owner.",
					"Some people think that the cloud icon (which refers to the Team Teriffic logo back then), does not mean anything to them, so we have changed it."
				],
				[
					"image",
					15721215066
				],
				[
					"fix",
					"Made some improvements to the chat filter."
				],
				[
					"add",
					"Added Christmas decorations to the Lobby."
				]
			]
		},
		{
			"id": 23121600,
			"updateType": "update",
			"title": "V3.4 Release Notes (17 Dec 2023)",
			"bannerImage": null,
			"content": [
				[
					"fix",
					"Fixed an issue where the Market sometimes doesn't load indefinitely."
				],
				[
					"fix",
					"Added text labels to the expand/collapse buttons of the Morph panels for easy access."
				],
				[
					"fix",
					"Fixed scaling issues with the Updates dialogue."
				],
				[
					"fix",
					"Fixed an issue where the screenshot sound effect does not play.",
					"Pressing the 'Print Screen' key on your keyboard when inside certain screens does not play a sound. This issue has now been resolved."
				],
				[
					"add",
					"Added a Portal Advertisement to the lobby."
				],
				[
					"add",
					"Added system message for when a person has been banned by Amburn."
				],
				[
					"fix",
					"Fixed an issue where when a character dies, the corresponding people list item doesn't reset."
				],
				[
					"remove",
					"Removed the automatic removal of Layered Clothing.",
					"Since exploits regarding Layered Clothing are infrequent nowadays, we have decided that we now removed a safety feature that has been added since V2 as we found that some people are complaining and showing their frustrations about the mentioned safety feature."
				],
				[
					"critical",
					"Fixed an issue where consumable props could be duped by resetting the character before they are loaded into the backpack."
				],
				[
					"add",
					"Added a piano to the Lobby."
				],
				[
					"add",
					"Added the Harp prop.",
					"To avoid the possibility of being banned, ensure that you either create an original piece or possess the appropriate rights to use the soundtrack you intend to play on the Harp."
				],
				[
					"fix",
					"Fixed additional issues."
				]
			]
		},
		{
			"id": 23121300,
			"updateType": "update",
			"title": "V3.3 Release Notes (13 Dec 2023)",
			"bannerImage": null,
			"content": [
				[
					"fix",
					"Updated the Audio Search keyword blacklist."
				],
				[
					"add",
					"Added 'TADC' to the Featured Searches in the Image Library."
				],
				[
					"fix",
					"Made the 'Development Build' text not visible on release builds."
				],
				[
					"add",
					"Added custom text filtering to roleplay names, bios, and Text Signs."
				],
				[
					"fix",
					"Fixed some formatting issues with the people list."
				],
				[
					"fix",
					"Fixed an issue where the Menu can still be drag-scrolled with a mouse while the Updates dialogue is open."
				],
				[
					"critical",
					"Fixed a serious issue where Amburn refuses to work.",
					"We didn't see this issue happening until we realised that a person who's not a staff member can fly without triggering the anti-cheat."
				],
				[
					"add",
					"Made use of the keyword blacklist when selecting an image that's not from the Marketplace."
				],
				[
					"fix",
					"Fixed some issues about searching for people whose roleplay name is changed after joining."
				],
				[
					"fix",
					"Improved the custom chat filter.",
					"It may not block words that the chat filter thinks it's offensive anymore, but that doesn't guarantee that it'll not block certain non-blacklisted words."
				],
				[
					"add",
					"Added the V2 Lobby map as a World.",
					"You can now visit the lobby from the previous major release of 2D Image Roleplay. To visit it, go to Menu > Worlds > V2 Lobby and click 'Teleport'."
				],
				[
					"fix",
					"Fixed other miscellaneous issues."
				]
			]
		},
		{
			"id": 23120600,
			"updateType": "update",
			"title": "V3.2 Release Notes (6 Dec 2023)",
			"bannerImage": null,
			"content": [
				[
					"fix",
					"Done some changes to group blacklist."
				],
				[
					"fix",
					"Fixed an issue where some words were unintentionally blocked in the chat by the filter."
				],
				[
					"fix",
					"Fixed some issues with validating images.",
					"There was an issue where some images in the Image Library failed to validate, especially ones made by Roblox groups."
				],
				[
					"fix",
					"Fixed an issue where staff members and Special people can be reported.",
					"We saw that staff members and Special people were shown in the dropdown when opening the Report prompt. That issue has now been resolved."
				],
				[
					"fix",
					"Fixed issues with the banning system."
				],
				[
					"fix",
					"Fixed an issue where the World Teleport prompt and the Worlds selection screen can be scrolled simultaneously by dragging with a mouse."
				],
				[
					"add",
					"Added a safety component to The Beach."
				]
			]
		},
		{
			"id": 23120100,
			"updateType": "event",
			"title": "Introducing 2D Image Roleplay V3",
			"bannerImage": 15479322104,
			"content": [
				[
					"text",
					"We have finally released the new major update of 2D Image Roleplay: Version 3. Now with a new look, new features, and a lot yet to come!"
				],
				[
					"text",
					"Here are some things that we've done in this major release:"
				],
				[
					"add",
					"Added Back Image",
					"This feature allows you to set an image on the back side of your morph. Simply go to the Morph screen, click the arrow beside the 'Back' field, and select an image from the Library. You can also type it in manually if you want."
				],
				[
					"add",
					"Added Mori and an EXP system",
					"We have added a feature that lets you earn Mori (a virtual currency) and EXP by visiting this experience. This will also help combat against abuse which means if people use an alt, they won't use intrusive props such as Boomboxes and Signs once they newly join."
				],
				[
					"add",
					"Added a custom Inventory feature",
					"It allows you to show or hide the hotbar, move props by holding down their respective button and clicking to somewhere in the hotbar or hide it in the Inventory window, and search for props using the search bar at the top right corner."
				],
				[
					"add",
					"Added Worlds",
					"To improve performance, we have split certain maps into 'Worlds'. This feature allows you to go to certain Worlds by entering one of the portals (in the Lobby), or by clicking on the 'Worlds' button on the menu."
				],
				[
					"critical",
					"Added some new safety features",
					"This includes custom chat filtering, which blocks certain words that some people might find offensive, and improvements with Amburn, our proprietary anti-cheat engine built specifically for 2D Image Roleplay."
				],
				[
					"fix",
					"Quality of life improvements",
					"We improved how everything in the interface behaves when being interacted. This includes collapsible panels in the Morph screen on mobile to fit more items more easily."
				],
				[
					"fix",
					"Improvements in performance",
					"We have managed to optimise this experience to make it more accessible on lower-end devices, including devices before 2018."
				],
				[
					"add",
					"Added Emu Otori to the Lobby",
					"Say 'Wonderhoy'."
				],
				[
					"remove",
					"Removed Herobrine"
				],
				[
					"text",
					"More features are yet to come in the near future!"
				]
			]
		},
		{
			"id": 23112700,
			"updateType": "notice",
			"title": "Information regarding to V2 shutdown",
			"bannerImage": 15478849594,
			"content": [
				[
					"text",
					"People are waiting to get 2D Image Roleplay to be publicly available again, and some are catching up on the progress of V3. It's been a while since the experience has been closed, so here are the reasons why we have to shut down the old 2D Image Roleplay V2."
				],
				[
					"text",
					"The first is to maintain the safety of other people as this major update includes a new safety system and a couple of security updates. Second, we will use the public release to assess certain features such as teleporting to other Worlds. And third, we had to shut it down because of an issue with the anti-cheat."
				],
				[
					"text",
					"Do not worry, as all your data from V2 which includes your Favourites, Recent Morphs, etc. are moved over to the new V3, and people who were banned by the anti-cheat due to an issue have now been unbanned."
				]
			]
		},
		{
			"id": 10000000,
			"updateType": "notice",
			"title": "Beware of Imitators",
			"bannerImage": 15478541056,
			"content": [
				[
					"text",
					"Experiences can be copied, decompiled, and saved entirely by bad actors using exploits, and a developer with malicious intent will also re-publish it and claim it as theirs."
				],
				[
					"text",
					"If you ever see an exact or slightly modified replica of 2D Image Roleplay, we recommend that you immediately report it to us on our community server."
				],
				[
					"text",
					"Imitations of this experience shall be removed under copyright law, so if we ever see one, we may file a DMCA takedown request against it."
				],
				[
					"text",
					"A person (which we will not disclose the name for safety reasons) had attempted to copy the entire 2D Image Roleplay V2 and its assets, but that isn't much of a big deal anymore because it's the previous version of this experience. You can learn more about this situation in the document posted on our community server (13+ only)."
				]
			]
		}
	]
}
