{
	"latest": 24040200,
	"template": [
		{
			"id": 24,
			"updateType": "update",
			"title": "V3. Release Notes ()",
			"bannerImage": null,
			"content": [
				[
					"fix",
					""
				],
				[
					"add",
					""
				],
				[
					"remove",
					""
				],
				[
					"critical",
					""
				],
				[
					"text",
					""
				]
			]
		}
	],
	"listing": [
		{
			"id": 24040200,
			"updateType": "update",
			"title": "V3.15: Revived Songs by Nuskit (2 Apr 24)",
			"bannerImage": null,
			"content": [
				[
					"fix",
					"<font color='#ffff80'>Successfully revived the Songs by Nuskit audio library.</font>",
					"You can now play your favourite video game music/OSTs uploaded by Nuskit on your Boombox, thanks to a simple technique that we should rather not disclose how it works. Currently, only audios before 8 March 2024 are available to play in 2D Image Roleplay."
				],
				[
					"fix",
					"Fixed an issue with user bans."
				],
				[
					"fix",
					"Fixed an issue with the Portals system."
				],
				[
					"fix",
					"Made the toast notification for Props being added to your Inventory show the icon for the Prop itself.",
					"Also added toast notification icons for Mori and Memberships being purchased as well."
				],
				[
					"fix",
					"Fixed an issue where the icon for Friends or Props toast notifications are tinted."
				],
				[
					"add",
					"Added Roblox's 'Builder' family to the font selection dropdowns."
				],
				[
					"fix",
					"Prevented people from earning playtime rewards during Idle/AFK."
				],
				[
					"fix",
					"Made the mouse cursor free in first-person mode by holding the Left Alt key (or Option for Mac users.)."
				],
				[
					"add",
					"Made the cursor switch to a crosshair while in first-person or with shift-lock on.",
					"It is useful for users who don't want to get distracted by the default cursor while in first-person."
				],
				[
					"fix",
					"Made some changes to the instructions on how to get Gift Codes in the Market."
				],
				[
					"add",
					"Added warnings for sending specific types of filtered words in the chat.",
					"Do not even try this or you may get yourself banned from this experience. Do this at your own risk. Here are some examples:"
				],
				[
					"image",
					16980622415
				],
				[
					"add",
					"Added new badges to the experience."
				],
				[
					"add",
					"Added a notification for when the mouse cursor is locked."
				],
				[
					"fix",
					"Fixed an issue where equipping the Robux prop in the City causes a permanent ban by the anti-cheat."
				]
			]
		},
		{
			"id": 24031700,
			"updateType": "update",
			"title": "2D Image Roleplay: Version π (17 Mar 2024)",
			"bannerImage": null,
			"content": [
				[
					"fix",
					"Made the chat box larger on mobile phones."
				],
				[
					"fix",
					"Made improvements to the Worlds select screen."
				],
				[
					"fix",
					"Made the dot for the Menu button will now disappear if <b>all</b> items in the Menu also have their dots disappeared."
				],
				[
					"add",
					"Added a notice dot to the Worlds button in the Menu.",
					"This points visitors to the World select screen before they can start roleplaying."
				],
				[
					"fix",
					"Prevented the Server Location from showing fictional locations (or placeholders), when possible.",
					"This does not guarantee that the Server Location won't as one of the placeholders due to certain errors on that cannot be fixed in the experience-side."
				],
				[
					"add",
					"<font color='#ffff80'>Added the Pie prop.</font>",
					"To celebrate an event that happened 3 days ago, we have added a new consumable, which is the 'Pie'. It is available to all users regardless of Roleplay rank."
				],
				[
					"fix",
					"Made improvements to the chat filter."
				],
				[
					"fix",
					"Made the images for the Updates have different scaling insteadead of having just one.",
					"This makes the some text more readable, especially if the size is small."
				],
				[
					"fix",
					"Prevented people from morphing while not in normal state (e.g. Swimming, Climbing, etc.)"
				],
				[
					"add",
					"Added the number of people who are inside the World on portals."
				],
				[
					"critical",
					"Made members of the 'Galaxiidae Games' Roblox group get automatically kicked from this experience.",
					"In response to a recent boycott situation happening in their Discord server, we have made a decision to permanently <b>block</b> any members of their Roblox group from joining 2D Image Roleplay."
				],
				[
					"add",
					"Added Portal text for the V2 Lobby."
				],
				[
					"add",
					"Added more zones to the Beach map."
				]
			]
		},
		{
		"id": 24031000,
		"updateType": "notice",
		"title": "Special: Minty/Nora Exposure Document",
		"bannerImage": 16679330529,
		"content": [
			[
				"text",
				"<i>This entry has been made for people who can't use Discord.</i>"
			],
			[
				"text",
				"Good Morning/Evening Galaxiidae Games Fans. We have made this document due to certain events that have transpired about her."
			],
			[
				"text",
				"Evidence has been submitted to me, Nami, through a private group chat with former staff members of “Galaxiidae Games”. We shall not disclose any of the persons who were involved."
			],
			[
				"text",
				"Minty/Nora, The owner of “Galaxiidae Games”, has used WonderStars to gain intelligence about the owner, the staff team and future plans for updates of 2D Image Roleplay, as well as <b>obtaining a local copy of the game without authorisation.</b>"
			],
			[
				"text",
				"<h1>Evidence</h1>"
			],
			[
				"text",
				"Here are some evidence submitted to me as follows:"
			],
			[
				"text",
				"<i>Due to Roblox moderation, all censor bars in <font color='#ff00dc'>magenta</font> refers to <b>Nami</b>, the owner himself, and <font color='#0094FF'>blue</font> refers to <b>Minty/Nora</b>, the perpetrator behind the story.</i>"
			],
			[
				"text",
				"<h2>Gathering information about me</h2>"
			],
			[
				"text",
				"These evidences show that Minty/Nora is in fact, using me for her personal gain. This includes gathering as much info from me as much as possible, and she admitted that she’s the type of person to do so."
			],
			[
				"image",
				16695792211,
				864, 556
			],
			[
				"image",
				16695828818,
				381, 244
			],
			[
				"image",
				16695843911,
				846, 112
			],
			[
				"text",
				"<h2>Having a downloaded copy of 2DIRP</h2>"
			],
			[
				"text",
				"The next one right here shows that Minty/Nora is <b>copying 2D Image Roleplay</b> and its source code, and <b>she does this while I am away or offline</b>. She is not authorised to obtain or download any of the game’s files, and <u>I only gave her Developer perms to make changes to her maps and make her audios playable in 2DIRP.</u>"
			],
			[
				"text",
				"This shows that Minty/Nora has given the files for 2DIRP to certain people she knows."
			],
			[
				"image",
				16695880330,
				578, 85
			],
			[
				"image",
				16695939536,
				575, 376
			],
			[
				"text",
				"The following message below is in Japanese but will have a translation under it."
			],
			[
				"image",
				16695955618,
				792, 271
			],
			[
				"text",
				"<i><b>Anonymous:</b> Yes. You can find more evidence if you wish. I put this in Japanese so you can understand me better. I don't know on which server she posted the v3 file, but I remember him saying that, and she said, \"I accidentally opened it. \"I lost it,\" he said.</i>"
			],
			[
				"text",
				"<i><b>Nami:</b> Yes, please.</i>"
			],
			[
				"text",
				"Here are some more evidence that she has a copy of 2DIRP:"
			],
			[
				"image",
				16696064492,
				541, 695
			],
			[
				"text",
				"This image shows that the file has been opened just recently."
			],
			[
				"image",
				16696087120,
				919, 540
			],
			[
				"image",
				16696106090,
				615, 126
			],
			[
				"image",
				16696126792,
				750, 253
			],
			[
				"text",
				"<i>Side note: The version of 2DIRP she downloaded is 3.11.1, which was released on February 18, 2024.</i>"
			],
			[
				"text",
				"<h1>Document about her plans</h1>"
			],
			[
				"text",
				"This image shows a document she made about her plans to manipulate me"
			],
			[
				"image",
				16696199992,
				740, 381
			],
			[
				"text",
				"<h1>Conclusion</h1>"
			],
			[
				"text",
				"Overall, Minty/Nora is in fact a <b>manipulative</b> person, and I regret being partners with her. We suggest blocking communications with her and any members who are on her server are advised to <b>leave</b> immediately."
			],
			[
				"text",
				"Also, players of \"Universal Interactions RP\" are advised to <b>stop playing</b> the game, and leave the group."
			],
			[
				"text",
				"That's all what I have in the document as of this moment. If you want to know more, please join our community server (13+ only)."
			]
		]
	},
		{
			"id": 24030900,
			"updateType": "notice",
			"title": "Important Information Regarding to Former Developer",
			"bannerImage": 16679330529,
			"content": [
				[
					"text",
					"To those who may be concerned, we had temporarily shut down 2D Image Roleplay regarding a recent unexpected scenario that occurred during this time."
				],
				[
					"text",
					"As it turns out, a now-former Developer of WonderStars, <b>@nora_univers3</b>, has been suspected of manipulating the owner to gather intelligence, as well as downloading a copy of 2D Image Roleplay (version 3.11.1) without proper authorisation."
				],
				[
					"text",
					"A document about this incident has been made and posted on the WonderStars Discord server with all the submitted evidence. If you want to learn more about this, you can read it yourself."
				],
				[
					"text",
					"This experience has now been reinstated after certain security patches have been made to ensure the safety of our users."
				],
				[
					"text",
					"<i>Notice: You must be at least 13 years old to use Discord.</i>"
				]
			]
		},
		{
			"id": 24030200,
			"updateType": "update",
			"title": "V3.13: New Settings and World People Counts (3 Mar 2024)",
			"bannerImage": null,
			"content": [
				[
					"fix",
					"Updated thumbnail for the Lobby map in Map Selector."
				],
				[
					"fix",
					"Made changes to the credits in Settings."
				],
				[
					"fix",
					"Updated the Report prompt.",
					"We have changed the size of the Report prompt, and this also fixes the issue where sometimes the contents of the window don't appear as it opens."
				],
				[
					"add",
					"Added info text showing location information.",
					"This shows your current location on the map, based on the zone you last visited. You can turn this off in the Settings."
				],
				[
					"fix",
					"Improved the Roleplay Name filter whitelist.",
					"This list will now get frequent updates without updating the entire experience."
				],
				[
					"add",
					"Added settings to hide or change the behaviour of the Minimap.",
					"For new users, the minimap rotation behaviour will be set to 'Fixed' by default but can be changed to rotate automatically with the camera in Settings."
				],
				[
					"add",
					"Added options to toggle the visibility of specific information in the status bar.",
					"These settings can be found in the Miscellaneous category."
				],
				[
					"fix",
					"Improved drag-scrolling for desktop."
				],
				[
					"fix",
					"Fixed issue where some keywords return no results."
				],
				[
					"add",
					"Added a player count to the Worlds list."
				]
			]
		},
		{
			"id": 24022400,
			"updateType": "update",
			"title": "V3.12: AFK Tag, Improved Icons, etc. (25 Feb 2024)",
			"bannerImage": null,
			"content": [
				[
					"fix",
					"Fixed an issue where in other maps, the text for the Map Select button shows as 'Lobby' by default."
				],
				[
					"fix",
					"Made sure that the icon for the Map Select button uses the thumbnail for the maps."
				],
				[
					"critical",
					"Ensured that characters won't be colliding each other again.",
					"This caused numerous exploit attempts such as flinging people. This also affects other features and easter eggs, such as claiming the 'Shout of Wonder' and the 'Pro Gamer' badge."
				],
				[
					"fix",
					"Fixed an issue where users cannot submit a report relating to sending messages in chat."
				],
				[
					"fix",
					"Changed capitalisation for 'Crop position' and 'Crop size'."
				],
				[
					"fix",
					"Made additional fixes user interface issues."
				],
				[
					"fix",
					"Made the Menu not drag-scrollable while the Rules window is open."
				],
				[
					"add",
					"Added the names of TADC characters to the filter whitelist.",
					"Setting your RP Name to one of the mentioned characters is guaranteed to not be filtered anymore as long as it's in a proper format."
				],
				[
					"fix",
					"Changed colour for the notification dot to make it more noticeable."
				],
				[
					"fix",
					"Fixed Nametag blocking part of the chat bubble."
				],
				[
					"fix",
					"Made some improvements to the chat filter.",
					"This makes servers run a little bit faster now, especially with multiple messages being sent at a time thanks to caching."
				],
				[
					"fix",
					"Improved icons for the Menu, Inventory and Rules."
				],
				[
					"add",
					"Added an 'Idle/AFK' tag that appears if no input has been detected from the user for at least 1 minute."
				],
				[
					"fix",
					"Fixed an issue where dropped Dice sometimes remains if its owner has left the server."
				],
				[
					"fix",
					"Made sure that the sides of the D20 Dice when equipped does not clip through images.",
					"For technical reasons, The dice now appear as a black colour when equipped, but it'll appear as pink when dropped."
				],
				[
					"fix",
					"Made some changes to the Laptop prop."
				],
				[
					"fix",
					"Moved the Menu button to the side of the minimap.",
					"This was done due to a Roblox UI update that causes its buttons on the left side to block the Menu button."
				],
				[
					"fix",
					"Fixed an issue with the structure in V2 Lobby.",
					"This shows that if a character spawns in the middle of the Lobby Park, they teleport to the top of the structure."
				],
				[
					"fix",
					"Made some fixes to the Friday Night Maps world."
				],
				[
					"fix",
					"Fixed an issue with the thumbnail for the 'Friday Night Maps' World as being low-quality."
				],
				[
					"fix",
					"Renamed the map from 'Sonic EXE' to 'Sonic.EXE'."
				]
			]
		},
		{
			"id": 24021600,
			"updateType": "update",
			"title": "V3.11: New props, new maps! (18 Feb 2024)",
			"bannerImage": null,
			"content": [
				[
					"fix",
					"Fixed an issue where an error mostly occurs when selecting a saved item from the Morph library.",
					"This happens to both the Favourites and the Recents. This issue has been fixed and most images can be used now."
				],
				[
					"add",
					"Added a new system where people can now be banned for 3 days after sending too many filtered messages."
				],
				[
					"add",
					"Fixed an issue where people get banned by the anti-cheat unexpectedly due to localisation problems."
				],
				[
					"add",
					"Added 2 new props to the experience.",
					"This includes <b>Dice</b> and <b>Dice D20</b>."
				],
				[
					"fix",
					"Improved the thumbnail for some maps in the Map selector.",
					"The thumbnail for some maps now shows an image of one specific place instead of showing the entire map, making it clear what is actually inside."
				],
				[
					"add",
					"Added new maps to the experience!",
					"We have added new maps based on the popular action rhythm game, \"Friday Night Funkin'\". These maps are based on the top 3 popular mods: <b>Vs. Kapi</b>, <b>Mid-fight masses</b>, and <b>Sonic.EXE</b>. To access the World containing these maps, go to Menu > Worlds, and select 'Friday Night Maps'."
				]
			]
		},
		{
			"id": 24020201,
			"updateType": "notice",
			"title": "Information regarding to February shutdown",
			"bannerImage": 14797490206,
			"content": [
				[
					"text",
					"It's been a while since the last shutdown of 2D Image Roleplay, but we did it again for the first time ever this year. Here is a story as to what happened and why the experience has shut down in the first place."
				],
				[
					"text",
					"There has been a recent admin abuse that happened a few days ago in which a now-blacklisted former staff member gave almost every person flying, causing the anti-cheat to ban them in an instant. Because of this tragic scenario, we have no choice but to unrank the person who is potentially responsible and shut down the experience to prevent further damage."
				],
				[
					"text",
					"If you have seen another (probably undercover) staff member who does this kind of behaviour, don't hesitate to report to us immediately by sending a message to @namireen via Roblox's Message feature, or on our official Discord server."
				]
			]
		},
		{
			"id": 24020200,
			"updateType": "update",
			"title": "V3.10 Release Notes (2 Feb 2024)",
			"bannerImage": null,
			"content": [
				[
					"fix",
					"Fixed an issue where people can't send messages when the chat fonts are set to italic ones (e.g. Source Sans Italic)."
				],
				[
					"fix",
					"Fixed the issue where Graphics settings for Computer has most lighting settings turned off by default."
				],
				[
					"fix",
					"Renamed shader settings to 'Lighting'."
				],
				[
					"fix",
					"Fixed the intensity of sun rays as it was too bright when looked directly at the sun."
				],
				[
					"critical",
					"Fixed an issue where certain props outside the Market falsely triggers the anti-cheat."
				],
				[
					"fix",
					"Fixed additional issues."
				]
			]
		},
		{
			"id": 24012100,
			"updateType": "update",
			"title": "V3.9 Release Notes (21 Jan 2024)",
			"bannerImage": null,
			"content": [
				[
					"fix",
					"Fixed a problem where people get banned by the anti-cheat for having certain props that are outside the Market."
				],
				[
					"fix",
					"Fixed an issue where two of the same character sounds were playing simultaneously."
				],
				[
					"fix",
					"[Market] Made the Props items section not scrollable while the 'Confirm purchase' dialogue is open."
				],
				[
					"fix",
					"Fixed an issue where people did not claim the 'Met the Creator' badge immediately when joining a server with the creator already in it."
				],
				[
					"add",
					"Added a badge for playing the game for 30 minutes straight.",
					"Because why not? :trollface:"
				],
				[
					"fix",
					"Fixed Bottle prop clipping through images."
				],
				[
					"add",
					"[Morph] Added size and position fields for the Image Crop screen."
				],
				[
					"add",
					"Added Graphics settings.",
					"These new settings allow you to enable or disable textures or meshes, as well as lighting such as atmosphere, bloom, and shadows."
				],
				[
					"fix",
					"Made most props affect loudness when changing the Props Volume."
				],
				[
					"fix",
					"Fixed additional issues."
				]
			]
		},
		{
			"id": 24011400,
			"updateType": "update",
			"title": "V3.8 Release Notes (14 Jan 2024)",
			"bannerImage": null,
			"content": [
				[
					"fix",
					"Fixed an issue where the anti-cheat sometimes kicks players when jumping off of a seat."
				],
				[
					"fix",
					"Added some improvements to the anti-cheat."
				],
				[
					"fix",
					"Fixed an issue where tapping and holding certain elements (like a prop item) doesn't work properly on mobile.",
					"We have this issue since the release of V3. We tried fixing this issue once, but failed."
				],
				[
					"fix",
					"Made improvements for the Report feature."
				],
				[
					"fix",
					"Made sure that the loading screen is skipped immediately when clicking on 'Skip loading'."
				],
				[
					"add",
					"Added more teleport points in V2 Lobby."
				],
				[
					"add",
					"Added a minimap for the Beach."
				],
				[
					"fix",
					"Fixed additional issues."
				]
			]
		},
		{
			"id": 23120100,
			"updateType": "event",
			"title": "Introducing 2D Image Roleplay V3",
			"bannerImage": 15479322104,
			"content": [
				[
					"text",
					"We have finally released the new major update of 2D Image Roleplay: Version 3. Now with a new look, new features, and a lot yet to come!"
				],
				[
					"text",
					"Here are some things that we've done in this major release:"
				],
				[
					"add",
					"Added Back Image",
					"This feature allows you to set an image on the back side of your morph. Simply go to the Morph screen, click the arrow beside the 'Back' field, and select an image from the Library. You can also type it in manually if you want."
				],
				[
					"add",
					"Added Mori and an EXP system",
					"We have added a feature that lets you earn Mori (a virtual currency) and EXP by visiting this experience. This will also help combat against abuse which means if people use an alt, they won't use intrusive props such as Boomboxes and Signs once they newly join."
				],
				[
					"add",
					"Added a custom Inventory feature",
					"It allows you to show or hide the hotbar, move props by holding down their respective button and clicking to somewhere in the hotbar or hide it in the Inventory window, and search for props using the search bar at the top right corner."
				],
				[
					"add",
					"Added Worlds",
					"To improve performance, we have split certain maps into 'Worlds'. This feature allows you to go to certain Worlds by entering one of the portals (in the Lobby), or by clicking on the 'Worlds' button on the menu."
				],
				[
					"critical",
					"Added some new safety features",
					"This includes custom chat filtering, which blocks certain words that some people might find offensive, and improvements with Amburn, our proprietary anti-cheat engine built specifically for 2D Image Roleplay."
				],
				[
					"fix",
					"Quality of life improvements",
					"We improved how everything in the interface behaves when being interacted. This includes collapsible panels in the Morph screen on mobile to fit more items more easily."
				],
				[
					"fix",
					"Improvements in performance",
					"We have managed to optimise this experience to make it more accessible on lower-end devices, including devices before 2018."
				],
				[
					"add",
					"Added Emu Otori to the Lobby",
					"Say 'Wonderhoy'."
				],
				[
					"remove",
					"Removed Herobrine"
				],
				[
					"text",
					"More features are yet to come in the near future!"
				]
			]
		},
		{
			"id": 23112700,
			"updateType": "notice",
			"title": "Information regarding to V2 shutdown",
			"bannerImage": 15478849594,
			"content": [
				[
					"text",
					"People are waiting to get 2D Image Roleplay to be publicly available again, and some are catching up on the progress of V3. It's been a while since the experience has been closed, so here are the reasons why we have to shut down the old 2D Image Roleplay V2."
				],
				[
					"text",
					"The first is to maintain the safety of other people as this major update includes a new safety system and a couple of security updates. Second, we will use the public release to assess certain features such as teleporting to other Worlds. And third, we had to shut it down because of an issue with the anti-cheat."
				],
				[
					"text",
					"Do not worry, as all your data from V2 which includes your Favourites, Recent Morphs, etc. are moved over to the new V3, and people who were banned by the anti-cheat due to an issue have now been unbanned."
				]
			]
		},
		{
			"id": 10000000,
			"updateType": "notice",
			"title": "Beware of Imitators",
			"bannerImage": 15478541056,
			"content": [
				[
					"text",
					"Experiences can be copied, decompiled, and saved entirely by bad actors using exploits, and a developer with malicious intent will also re-publish it and claim it as theirs."
				],
				[
					"text",
					"If you ever see an exact or slightly modified replica of 2D Image Roleplay, we recommend that you immediately report it to us on our community server."
				],
				[
					"text",
					"Imitations of this experience shall be removed under copyright law, so if we ever see one, we may file a DMCA takedown request against it."
				],
				[
					"text",
					"A person (which we will not disclose the name for safety reasons) had attempted to copy the entire 2D Image Roleplay V2 and its assets, but that isn't much of a big deal anymore because it's the previous version of this experience. You can learn more about this situation in the document posted on our community server (13+ only)."
				]
			]
		}
	],
	"archive": [
		{
			"id": 24010600,
			"updateType": "update",
			"title": "V3.7 Release Notes (6 Jan 2024)",
			"bannerImage": null,
			"content": [
				[
					"fix",
					"Fixed an issue regarding the sound for the Airhorn prop.",
					"Sounds coming from the Airhorn prop cannot be heard from farther away anymore."
				],
				[
					"fix",
					"Fixed sound distance for the Drums prop."
				],
				[
					"fix",
					"Made sure that cropping resets when restoring defaults for the scaling in the Morph screen."
				],
				[
					"remove",
					"Removed 'amongusred3223' from the Special Thanks section in the Settings.",
					"This is due to a breach of contract with the mentioned user, and other reasons that we should rather not disclose."
				],
				[
					"add",
					"Added an option to use the system time as the time of day in the Settings."
				],
				[
					"critical",
					"Added improvements to Amburn anti-cheat."
				],
				[
					"fix",
					"Fixed issues with the chat filter."
				],
				[
					"fix",
					"Updated role icon for people whose chatting features are disabled."
				],
				[
					"fix",
					"Fixed additional issues."
				]
			]
		},
		{
			"id": 23123000,
			"updateType": "update",
			"title": "V3.6 Release Notes (30 Dec 2023)",
			"bannerImage": null,
			"content": [
				[
					"fix",
					"Fixed the sound distance for the Piano in the Lobby."
				],
				[
					"fix",
					"Fixed writing issue in the About section of the Settings."
				],
				[
					"add",
					"Added buttons that allows you to restore certain properties to their defaults on the Morph customisation."
				],
				[
					"fix",
					"Fixed additional issues."
				]
			]
		},
		{
			"id": 23122300,
			"updateType": "update",
			"title": "V3.5 Release Notes (23 Dec 2023)",
			"bannerImage": null,
			"content": [
				[
					"fix",
					"Fixed an issue where Special group members don't have Gold Membership automatically."
				],
				[
					"fix",
					"Done some rewording on the Selfie screen and Favourites removal messages."
				],
				[
					"fix",
					"Updated search keyword blacklist for the Audio Library."
				],
				[
					"fix",
					"Fixed an issue where characters start colliding with each other."
				],
				[
					"add",
					"Added a sign beside the Portal Ad in the Lobby."
				],
				[
					"fix",
					"Prevent new items from getting added to the people list when searching for a person."
				],
				[
					"fix",
					"Fixed an issue with the in-experience chat system."
				],
				[
					"fix",
					"Fixed an issue with saving purchased props."
				],
				[
					"fix",
					"Fixed issues with the custom chat filter."
				],
				[
					"fix",
					"Updated the icon for Owner and Co-owner.",
					"Some people think that the cloud icon (which refers to the Team Teriffic logo back then), does not mean anything to them, so we have changed it."
				],
				[
					"image",
					15721215066
				],
				[
					"fix",
					"Made some improvements to the chat filter."
				],
				[
					"add",
					"Added Christmas decorations to the Lobby."
				]
			]
		},
		{
			"id": 23121600,
			"updateType": "update",
			"title": "V3.4 Release Notes (17 Dec 2023)",
			"bannerImage": null,
			"content": [
				[
					"fix",
					"Fixed an issue where the Market sometimes doesn't load indefinitely."
				],
				[
					"fix",
					"Added text labels to the expand/collapse buttons of the Morph panels for easy access."
				],
				[
					"fix",
					"Fixed scaling issues with the Updates dialogue."
				],
				[
					"fix",
					"Fixed an issue where the screenshot sound effect does not play.",
					"Pressing the 'Print Screen' key on your keyboard when inside certain screens does not play a sound. This issue has now been resolved."
				],
				[
					"add",
					"Added a Portal Advertisement to the lobby."
				],
				[
					"add",
					"Added system message for when a person has been banned by Amburn."
				],
				[
					"fix",
					"Fixed an issue where when a character dies, the corresponding people list item doesn't reset."
				],
				[
					"remove",
					"Removed the automatic removal of Layered Clothing.",
					"Since exploits regarding Layered Clothing are infrequent nowadays, we have decided that we now removed a safety feature that has been added since V2 as we found that some people are complaining and showing their frustrations about the mentioned safety feature."
				],
				[
					"critical",
					"Fixed an issue where consumable props could be duped by resetting the character before they are loaded into the backpack."
				],
				[
					"add",
					"Added a piano to the Lobby."
				],
				[
					"add",
					"Added the Harp prop.",
					"To avoid the possibility of being banned, ensure that you either create an original piece or possess the appropriate rights to use the soundtrack you intend to play on the Harp."
				],
				[
					"fix",
					"Fixed additional issues."
				]
			]
		},
		{
			"id": 23121300,
			"updateType": "update",
			"title": "V3.3 Release Notes (13 Dec 2023)",
			"bannerImage": null,
			"content": [
				[
					"fix",
					"Updated the Audio Search keyword blacklist."
				],
				[
					"add",
					"Added 'TADC' to the Featured Searches in the Image Library."
				],
				[
					"fix",
					"Made the 'Development Build' text not visible on release builds."
				],
				[
					"add",
					"Added custom text filtering to roleplay names, bios, and Text Signs."
				],
				[
					"fix",
					"Fixed some formatting issues with the people list."
				],
				[
					"fix",
					"Fixed an issue where the Menu can still be drag-scrolled with a mouse while the Updates dialogue is open."
				],
				[
					"critical",
					"Fixed a serious issue where Amburn refuses to work.",
					"We didn't see this issue happening until we realised that a person who's not a staff member can fly without triggering the anti-cheat."
				],
				[
					"add",
					"Made use of the keyword blacklist when selecting an image that's not from the Marketplace."
				],
				[
					"fix",
					"Fixed some issues about searching for people whose roleplay name is changed after joining."
				],
				[
					"fix",
					"Improved the custom chat filter.",
					"It may not block words that the chat filter thinks it's offensive anymore, but that doesn't guarantee that it'll not block certain non-blacklisted words."
				],
				[
					"add",
					"Added the V2 Lobby map as a World.",
					"You can now visit the lobby from the previous major release of 2D Image Roleplay. To visit it, go to Menu > Worlds > V2 Lobby and click 'Teleport'."
				],
				[
					"fix",
					"Fixed other miscellaneous issues."
				]
			]
		},
		{
			"id": 23120600,
			"updateType": "update",
			"title": "V3.2 Release Notes (6 Dec 2023)",
			"bannerImage": null,
			"content": [
				[
					"fix",
					"Done some changes to group blacklist."
				],
				[
					"fix",
					"Fixed an issue where some words were unintentionally blocked in the chat by the filter."
				],
				[
					"fix",
					"Fixed some issues with validating images.",
					"There was an issue where some images in the Image Library failed to validate, especially ones made by Roblox groups."
				],
				[
					"fix",
					"Fixed an issue where staff members and Special people can be reported.",
					"We saw that staff members and Special people were shown in the dropdown when opening the Report prompt. That issue has now been resolved."
				],
				[
					"fix",
					"Fixed issues with the banning system."
				],
				[
					"fix",
					"Fixed an issue where the World Teleport prompt and the Worlds selection screen can be scrolled simultaneously by dragging with a mouse."
				],
				[
					"add",
					"Added a safety component to The Beach."
				]
			]
		}
	]
}
